# a. Виведіть третій символ цього рядка.
#first_name = 'Виведіть передостанній символ цього рядка.'
#print(first_name[2])

# b. Виведіть передостанній символ цього рядка.
#first_name = 'Виведіть передостанній символ цього рядка.'
#print(first_name[-2])

# c. Виведіть перші п'ять символи цього рядка.
#string = 'Виведіть передостанній символ цього рядка.'
#print (string[:5])

# d. Виведіть весь рядок, крім двох останніх символів.
#string = 'Виведіть передостанній символ цього рядка.'
#print(string[:-2])

# e. Виведіть усі символи з парними індексами (починаючи з першого).
#string = 'Виведіть передостанній символ цього рядка.'
#print(string[::2])

# f. Виведіть усі символи з непарними індексами, починаючи з другого символу рядка.
#string = 'Виведіть передостанній символ цього рядка.'
#print(string[1::2])

# g. Виведіть усі символи у зворотному порядку.
#string = 'Виведіть передостанній символ цього рядка.'
#print(string[::-1])

# h. Виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
#string = 'Виведіть передостанній символ цього рядка.'
#print(string[::-2])

# i. Виведіть довжину цього рядка.
#string = 'Виведіть передостанній символ цього рядка.'
#print(len(string))

# 2.Дано рядок, що складається зі слів, розділених пробілами. Визначте, скільки у ній слів.
#string= 'Виведіть передостанній символ цього рядка.'
#print(string.count(' ' )+1)

#3. Користувач вводить окремо рядок `s` та один символ `ch`. Необхідно здійснити пошук у рядку `s` всіх символів `ch`.
#Для вирішення можна використовувати тільки функцію `find` (rfind), оператори `if` та `for` (while).
# Даний рядок


#s = 'rich'
#print(s.find('ch'))
#print(s.rfind('ch'))

#4. Дано рядок. Замініть у цьому рядку всі появи літери `h` на літеру `H`, крім першого та останнього входження.

# Даний рядок

s = 'hhhhhhhhhhhhhhhhhhhh'
s = s.replace('h', 'H', s.count('h') - 1)
s = s.replace('H', 'h', 1)
print(s)
